ARMmbed/mbed-os/targets/TARGET_Atmel/TARGET_SAM_CortexM0P/utils/cmsis/TARGET_SAML21/include/component/comp_tcc.h
// DITH4 mode
#define TCC_PER_DITH4_DITHER_Pos    0            /**< \brief (TCC_PER_DITH4) Dithering Cycle Number */
#define TCC_PER_DITH4_DITHER_Msk    (0xFul << TCC_PER_DITH4_DITHER_Pos)
#define TCC_PER_DITH4_DITHER(value) ((TCC_PER_DITH4_DITHER_Msk & ((value) << TCC_PER_DITH4_DITHER_Pos)))
#define TCC_PER_DITH4_PER_Pos       4            /**< \brief (TCC_PER_DITH4) Period Value */
#define TCC_PER_DITH4_PER_Msk       (0xFFFFFul << TCC_PER_DITH4_PER_Pos)
#define TCC_PER_DITH4_PER(value)    ((TCC_PER_DITH4_PER_Msk & ((value) << TCC_PER_DITH4_PER_Pos)))
#define TCC_PER_DITH4_MASK          0x00FFFFFFul /**< \brief (TCC_PER_DITH4) MASK Register */

// DITH5 mode
#define TCC_PER_DITH5_DITHER_Pos    0            /**< \brief (TCC_PER_DITH5) Dithering Cycle Number */
#define TCC_PER_DITH5_DITHER_Msk    (0x1Ful << TCC_PER_DITH5_DITHER_Pos)
#define TCC_PER_DITH5_DITHER(value) ((TCC_PER_DITH5_DITHER_Msk & ((value) << TCC_PER_DITH5_DITHER_Pos)))
#define TCC_PER_DITH5_PER_Pos       5            /**< \brief (TCC_PER_DITH5) Period Value */
#define TCC_PER_DITH5_PER_Msk       (0x7FFFFul << TCC_PER_DITH5_PER_Pos)
#define TCC_PER_DITH5_PER(value)    ((TCC_PER_DITH5_PER_Msk & ((value) << TCC_PER_DITH5_PER_Pos)))
#define TCC_PER_DITH5_MASK          0x00FFFFFFul /**< \brief (TCC_PER_DITH5) MASK Register */

// DITH6 mode
#define TCC_PER_DITH6_DITHER_Pos    0            /**< \brief (TCC_PER_DITH6) Dithering Cycle Number */
#define TCC_PER_DITH6_DITHER_Msk    (0x3Ful << TCC_PER_DITH6_DITHER_Pos)
#define TCC_PER_DITH6_DITHER(value) ((TCC_PER_DITH6_DITHER_Msk & ((value) << TCC_PER_DITH6_DITHER_Pos)))
#define TCC_PER_DITH6_PER_Pos       6            /**< \brief (TCC_PER_DITH6) Period Value */
#define TCC_PER_DITH6_PER_Msk       (0x3FFFFul << TCC_PER_DITH6_PER_Pos)
#define TCC_PER_DITH6_PER(value)    ((TCC_PER_DITH6_PER_Msk & ((value) << TCC_PER_DITH6_PER_Pos)))
#define TCC_PER_DITH6_MASK          0x00FFFFFFul /**< \brief (TCC_PER_DITH6) MASK Register */

#define TCC_PER_PER_Pos             0            /**< \brief (TCC_PER) Period Value */
#define TCC_PER_PER_Msk             (0xFFFFFFul << TCC_PER_PER_Pos)
#define TCC_PER_PER(value)          ((TCC_PER_PER_Msk & ((value) << TCC_PER_PER_Pos)))
#define TCC_PER_MASK                0x00FFFFFFul /**< \brief (TCC_PER) MASK Register */

/* -------- TCC_CC : (TCC Offset: 0x44) (R/W 32) Compare and Capture -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct { // DITH4 mode
        uint32_t DITHER: 4;        /*!< bit:  0.. 3  Dithering Cycle Number             */
        uint32_t CC: 20;           /*!< bit:  4..23  Channel Compare/Capture Value      */
        uint32_t : 8;              /*!< bit: 24..31  Reserved                           */
    } DITH4;                     /*!< Structure used for DITH4                        */
    struct { // DITH5 mode
        uint32_t DITHER: 5;        /*!< bit:  0.. 4  Dithering Cycle Number             */
        uint32_t CC: 19;           /*!< bit:  5..23  Channel Compare/Capture Value      */
        uint32_t : 8;              /*!< bit: 24..31  Reserved                           */
    } DITH5;                     /*!< Structure used for DITH5                        */
    struct { // DITH6 mode
        uint32_t DITHER: 6;        /*!< bit:  0.. 5  Dithering Cycle Number             */
        uint32_t CC: 18;           /*!< bit:  6..23  Channel Compare/Capture Value      */
        uint32_t : 8;              /*!< bit: 24..31  Reserved                           */
    } DITH6;                     /*!< Structure used for DITH6                        */
    struct {
        uint32_t CC: 24;           /*!< bit:  0..23  Channel Compare/Capture Value      */
        uint32_t : 8;              /*!< bit: 24..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} TCC_CC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TCC_CC_OFFSET               0x44         /**< \brief (TCC_CC offset) Compare and Capture */
#define TCC_CC_RESETVALUE           0x00000000ul /**< \brief (TCC_CC reset_value) Compare and Capture */

// DITH4 mode
#define TCC_CC_DITH4_DITHER_Pos     0            /**< \brief (TCC_CC_DITH4) Dithering Cycle Number */
#define TCC_CC_DITH4_DITHER_Msk     (0xFul << TCC_CC_DITH4_DITHER_Pos)
#define TCC_CC_DITH4_DITHER(value)  ((TCC_CC_DITH4_DITHER_Msk & ((value) << TCC_CC_DITH4_DITHER_Pos)))
#define TCC_CC_DITH4_CC_Pos         4            /**< \brief (TCC_CC_DITH4) Channel Compare/Capture Value */
#define TCC_CC_DITH4_CC_Msk         (0xFFFFFul << TCC_CC_DITH4_CC_Pos)
#define TCC_CC_DITH4_CC(value)      ((TCC_CC_DITH4_CC_Msk & ((value) << TCC_CC_DITH4_CC_Pos)))
#define TCC_CC_DITH4_MASK           0x00FFFFFFul /**< \brief (TCC_CC_DITH4) MASK Register */

// DITH5 mode
#define TCC_CC_DITH5_DITHER_Pos     0            /**< \brief (TCC_CC_DITH5) Dithering Cycle Number */
#define TCC_CC_DITH5_DITHER_Msk     (0x1Ful << TCC_CC_DITH5_DITHER_Pos)
#define TCC_CC_DITH5_DITHER(value)  ((TCC_CC_DITH5_DITHER_Msk & ((value) << TCC_CC_DITH5_DITHER_Pos)))
#define TCC_CC_DITH5_CC_Pos         5            /**< \brief (TCC_CC_DITH5) Channel Compare/Capture Value */
#define TCC_CC_DITH5_CC_Msk         (0x7FFFFul << TCC_CC_DITH5_CC_Pos)
#define TCC_CC_DITH5_CC(value)      ((TCC_CC_DITH5_CC_Msk & ((value) << TCC_CC_DITH5_CC_Pos)))
#define TCC_CC_DITH5_MASK           0x00FFFFFFul /**< \brief (TCC_CC_DITH5) MASK Register */

// DITH6 mode
#define TCC_CC_DITH6_DITHER_Pos     0            /**< \brief (TCC_CC_DITH6) Dithering Cycle Number */
#define TCC_CC_DITH6_DITHER_Msk     (0x3Ful << TCC_CC_DITH6_DITHER_Pos)
#define TCC_CC_DITH6_DITHER(value)  ((TCC_CC_DITH6_DITHER_Msk & ((value) << TCC_CC_DITH6_DITHER_Pos)))
#define TCC_CC_DITH6_CC_Pos         6            /**< \brief (TCC_CC_DITH6) Channel Compare/Capture Value */
#define TCC_CC_DITH6_CC_Msk         (0x3FFFFul << TCC_CC_DITH6_CC_Pos)
#define TCC_CC_DITH6_CC(value)      ((TCC_CC_DITH6_CC_Msk & ((value) << TCC_CC_DITH6_CC_Pos)))
#define TCC_CC_DITH6_MASK           0x00FFFFFFul /**< \brief (TCC_CC_DITH6) MASK Register */

#define TCC_CC_CC_Pos               0            /**< \brief (TCC_CC) Channel Compare/Capture Value */
#define TCC_CC_CC_Msk               (0xFFFFFFul << TCC_CC_CC_Pos)
#define TCC_CC_CC(value)            ((TCC_CC_CC_Msk & ((value) << TCC_CC_CC_Pos)))
#define TCC_CC_MASK                 0x00FFFFFFul /**< \brief (TCC_CC) MASK Register */

/* -------- TCC_PATTBUF : (TCC Offset: 0x64) (R/W 16) Pattern Buffer -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint16_t PGEB0: 1;         /*!< bit:      0  Pattern Generator 0 Output Enable Buffer */
        uint16_t PGEB1: 1;         /*!< bit:      1  Pattern Generator 1 Output Enable Buffer */
        uint16_t PGEB2: 1;         /*!< bit:      2  Pattern Generator 2 Output Enable Buffer */
        uint16_t PGEB3: 1;         /*!< bit:      3  Pattern Generator 3 Output Enable Buffer */
        uint16_t PGEB4: 1;         /*!< bit:      4  Pattern Generator 4 Output Enable Buffer */
        uint16_t PGEB5: 1;         /*!< bit:      5  Pattern Generator 5 Output Enable Buffer */
        uint16_t PGEB6: 1;         /*!< bit:      6  Pattern Generator 6 Output Enable Buffer */
        uint16_t PGEB7: 1;         /*!< bit:      7  Pattern Generator 7 Output Enable Buffer */
        uint16_t PGVB0: 1;         /*!< bit:      8  Pattern Generator 0 Output Enable  */
        uint16_t PGVB1: 1;         /*!< bit:      9  Pattern Generator 1 Output Enable  */
        uint16_t PGVB2: 1;         /*!< bit:     10  Pattern Generator 2 Output Enable  */
        uint16_t PGVB3: 1;         /*!< bit:     11  Pattern Generator 3 Output Enable  */
        uint16_t PGVB4: 1;         /*!< bit:     12  Pattern Generator 4 Output Enable  */
        uint16_t PGVB5: 1;         /*!< bit:     13  Pattern Generator 5 Output Enable  */
        uint16_t PGVB6: 1;         /*!< bit:     14  Pattern Generator 6 Output Enable  */
        uint16_t PGVB7: 1;         /*!< bit:     15  Pattern Generator 7 Output Enable  */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint16_t PGEB: 8;          /*!< bit:  0.. 7  Pattern Generator x Output Enable Buffer */
        uint16_t PGVB: 8;          /*!< bit:  8..15  Pattern Generator x Output Enable  */
    } vec;                       /*!< Structure used for vec  access                  */
    uint16_t reg;                /*!< Type      used for register access              */
} TCC_PATTBUF_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TCC_PATTBUF_OFFSET          0x64         /**< \brief (TCC_PATTBUF offset) Pattern Buffer */
#define TCC_PATTBUF_RESETVALUE      0x0000ul     /**< \brief (TCC_PATTBUF reset_value) Pattern Buffer */

#define TCC_PATTBUF_PGEB0_Pos       0            /**< \brief (TCC_PATTBUF) Pattern Generator 0 Output Enable Buffer */
#define TCC_PATTBUF_PGEB0           (1 << TCC_PATTBUF_PGEB0_Pos)
#define TCC_PATTBUF_PGEB1_Pos       1            /**< \brief (TCC_PATTBUF) Pattern Generator 1 Output Enable Buffer */
#define TCC_PATTBUF_PGEB1           (1 << TCC_PATTBUF_PGEB1_Pos)
#define TCC_PATTBUF_PGEB2_Pos       2            /**< \brief (TCC_PATTBUF) Pattern Generator 2 Output Enable Buffer */
#define TCC_PATTBUF_PGEB2           (1 << TCC_PATTBUF_PGEB2_Pos)
#define TCC_PATTBUF_PGEB3_Pos       3            /**< \brief (TCC_PATTBUF) Pattern Generator 3 Output Enable Buffer */
#define TCC_PATTBUF_PGEB3           (1 << TCC_PATTBUF_PGEB3_Pos)
#define TCC_PATTBUF_PGEB4_Pos       4            /**< \brief (TCC_PATTBUF) Pattern Generator 4 Output Enable Buffer */
#define TCC_PATTBUF_PGEB4           (1 << TCC_PATTBUF_PGEB4_Pos)
#define TCC_PATTBUF_PGEB5_Pos       5            /**< \brief (TCC_PATTBUF) Pattern Generator 5 Output Enable Buffer */
#define TCC_PATTBUF_PGEB5           (1 << TCC_PATTBUF_PGEB5_Pos)
#define TCC_PATTBUF_PGEB6_Pos       6            /**< \brief (TCC_PATTBUF) Pattern Generator 6 Output Enable Buffer */
#define TCC_PATTBUF_PGEB6           (1 << TCC_PATTBUF_PGEB6_Pos)
#define TCC_PATTBUF_PGEB7_Pos       7            /**< \brief (TCC_PATTBUF) Pattern Generator 7 Output Enable Buffer */
#define TCC_PATTBUF_PGEB7           (1 << TCC_PATTBUF_PGEB7_Pos)
#define TCC_PATTBUF_PGEB_Pos        0            /**< \brief (TCC_PATTBUF) Pattern Generator x Output Enable Buffer */
#define TCC_PATTBUF_PGEB_Msk        (0xFFul << TCC_PATTBUF_PGEB_Pos)
#define TCC_PATTBUF_PGEB(value)     ((TCC_PATTBUF_PGEB_Msk & ((value) << TCC_PATTBUF_PGEB_Pos)))
#define TCC_PATTBUF_PGVB0_Pos       8            /**< \brief (TCC_PATTBUF) Pattern Generator 0 Output Enable */
#define TCC_PATTBUF_PGVB0           (1 << TCC_PATTBUF_PGVB0_Pos)
#define TCC_PATTBUF_PGVB1_Pos       9            /**< \brief (TCC_PATTBUF) Pattern Generator 1 Output Enable */
#define TCC_PATTBUF_PGVB1           (1 << TCC_PATTBUF_PGVB1_Pos)
#define TCC_PATTBUF_PGVB2_Pos       10           /**< \brief (TCC_PATTBUF) Pattern Generator 2 Output Enable */
#define TCC_PATTBUF_PGVB2           (1 << TCC_PATTBUF_PGVB2_Pos)
#define TCC_PATTBUF_PGVB3_Pos       11           /**< \brief (TCC_PATTBUF) Pattern Generator 3 Output Enable */
#define TCC_PATTBUF_PGVB3           (1 << TCC_PATTBUF_PGVB3_Pos)
#define TCC_PATTBUF_PGVB4_Pos       12           /**< \brief (TCC_PATTBUF) Pattern Generator 4 Output Enable */
#define TCC_PATTBUF_PGVB4           (1 << TCC_PATTBUF_PGVB4_Pos)
#define TCC_PATTBUF_PGVB5_Pos       13           /**< \brief (TCC_PATTBUF) Pattern Generator 5 Output Enable */
#define TCC_PATTBUF_PGVB5           (1 << TCC_PATTBUF_PGVB5_Pos)
#define TCC_PATTBUF_PGVB6_Pos       14           /**< \brief (TCC_PATTBUF) Pattern Generator 6 Output Enable */
#define TCC_PATTBUF_PGVB6           (1 << TCC_PATTBUF_PGVB6_Pos)
#define TCC_PATTBUF_PGVB7_Pos       15           /**< \brief (TCC_PATTBUF) Pattern Generator 7 Output Enable */
#define TCC_PATTBUF_PGVB7           (1 << TCC_PATTBUF_PGVB7_Pos)
#define TCC_PATTBUF_PGVB_Pos        8            /**< \brief (TCC_PATTBUF) Pattern Generator x Output Enable */
#define TCC_PATTBUF_PGVB_Msk        (0xFFul << TCC_PATTBUF_PGVB_Pos)
#define TCC_PATTBUF_PGVB(value)     ((TCC_PATTBUF_PGVB_Msk & ((value) << TCC_PATTBUF_PGVB_Pos)))
#define TCC_PATTBUF_MASK            0xFFFFul     /**< \brief (TCC_PATTBUF) MASK Register */

/* -------- TCC_WAVEBUF : (TCC Offset: 0x68) (R/W 32) Waveform Control Buffer -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t WAVEGENB: 3;      /*!< bit:  0.. 2  Waveform Generation Buffer         */
        uint32_t : 1;              /*!< bit:      3  Reserved                           */
        uint32_t RAMPB: 2;         /*!< bit:  4.. 5  Ramp Mode Buffer                   */
        uint32_t : 1;              /*!< bit:      6  Reserved                           */
        uint32_t CIPERENB: 1;      /*!< bit:      7  Circular Period Enable Buffer      */
        uint32_t CICCENB0: 1;      /*!< bit:      8  Circular Channel 0 Enable Buffer   */
        uint32_t CICCENB1: 1;      /*!< bit:      9  Circular Channel 1 Enable Buffer   */
        uint32_t CICCENB2: 1;      /*!< bit:     10  Circular Channel 2 Enable Buffer   */
        uint32_t CICCENB3: 1;      /*!< bit:     11  Circular Channel 3 Enable Buffer   */
        uint32_t : 4;              /*!< bit: 12..15  Reserved                           */
        uint32_t POLB0: 1;         /*!< bit:     16  Channel 0 Polarity Buffer          */
        uint32_t POLB1: 1;         /*!< bit:     17  Channel 1 Polarity Buffer          */
        uint32_t POLB2: 1;         /*!< bit:     18  Channel 2 Polarity Buffer          */
        uint32_t POLB3: 1;         /*!< bit:     19  Channel 3 Polarity Buffer          */
        uint32_t : 4;              /*!< bit: 20..23  Reserved                           */
        uint32_t SWAPB0: 1;        /*!< bit:     24  Swap DTI Output Pair 0 Buffer      */
        uint32_t SWAPB1: 1;        /*!< bit:     25  Swap DTI Output Pair 1 Buffer      */
        uint32_t SWAPB2: 1;        /*!< bit:     26  Swap DTI Output Pair 2 Buffer      */
        uint32_t SWAPB3: 1;        /*!< bit:     27  Swap DTI Output Pair 3 Buffer      */
        uint32_t : 4;              /*!< bit: 28..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint32_t : 8;              /*!< bit:  0.. 7  Reserved                           */
        uint32_t CICCENB: 4;       /*!< bit:  8..11  Circular Channel x Enable Buffer   */
        uint32_t : 4;              /*!< bit: 12..15  Reserved                           */
        uint32_t POLB: 4;          /*!< bit: 16..19  Channel x Polarity Buffer          */
        uint32_t : 4;              /*!< bit: 20..23  Reserved                           */
        uint32_t SWAPB: 4;         /*!< bit: 24..27  Swap DTI Output Pair x Buffer      */
        uint32_t : 4;              /*!< bit: 28..31  Reserved                           */
    } vec;                       /*!< Structure used for vec  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} TCC_WAVEBUF_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TCC_WAVEBUF_OFFSET          0x68         /**< \brief (TCC_WAVEBUF offset) Waveform Control Buffer */
#define TCC_WAVEBUF_RESETVALUE      0x00000000ul /**< \brief (TCC_WAVEBUF reset_value) Waveform Control Buffer */

#define TCC_WAVEBUF_WAVEGENB_Pos    0            /**< \brief (TCC_WAVEBUF) Waveform Generation Buffer */
#define TCC_WAVEBUF_WAVEGENB_Msk    (0x7ul << TCC_WAVEBUF_WAVEGENB_Pos)
#define TCC_WAVEBUF_WAVEGENB(value) ((TCC_WAVEBUF_WAVEGENB_Msk & ((value) << TCC_WAVEBUF_WAVEGENB_Pos)))
#define   TCC_WAVEBUF_WAVEGENB_NFRQ_Val   0x0ul  /**< \brief (TCC_WAVEBUF) Normal frequency */
#define   TCC_WAVEBUF_WAVEGENB_MFRQ_Val   0x1ul  /**< \brief (TCC_WAVEBUF) Match frequency */
#define   TCC_WAVEBUF_WAVEGENB_NPWM_Val   0x2ul  /**< \brief (TCC_WAVEBUF) Normal PWM */
#define   TCC_WAVEBUF_WAVEGENB_DSCRITICAL_Val 0x4ul  /**< \brief (TCC_WAVEBUF) Dual-slope critical */
#define   TCC_WAVEBUF_WAVEGENB_DSBOTTOM_Val 0x5ul  /**< \brief (TCC_WAVEBUF) Dual-slope with interrupt/event condition when COUNT reaches ZERO */
#define   TCC_WAVEBUF_WAVEGENB_DSBOTH_Val 0x6ul  /**< \brief (TCC_WAVEBUF) Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP */
#define   TCC_WAVEBUF_WAVEGENB_DSTOP_Val  0x7ul  /**< \brief (TCC_WAVEBUF) Dual-slope with interrupt/event condition when COUNT reaches TOP */
#define TCC_WAVEBUF_WAVEGENB_NFRQ   (TCC_WAVEBUF_WAVEGENB_NFRQ_Val << TCC_WAVEBUF_WAVEGENB_Pos)
#define TCC_WAVEBUF_WAVEGENB_MFRQ   (TCC_WAVEBUF_WAVEGENB_MFRQ_Val << TCC_WAVEBUF_WAVEGENB_Pos)
#define TCC_WAVEBUF_WAVEGENB_NPWM   (TCC_WAVEBUF_WAVEGENB_NPWM_Val << TCC_WAVEBUF_WAVEGENB_Pos)
#define TCC_WAVEBUF_WAVEGENB_DSCRITICAL (TCC_WAVEBUF_WAVEGENB_DSCRITICAL_Val << TCC_WAVEBUF_WAVEGENB_Pos)
#define TCC_WAVEBUF_WAVEGENB_DSBOTTOM (TCC_WAVEBUF_WAVEGENB_DSBOTTOM_Val << TCC_WAVEBUF_WAVEGENB_Pos)
#define TCC_WAVEBUF_WAVEGENB_DSBOTH (TCC_WAVEBUF_WAVEGENB_DSBOTH_Val << TCC_WAVEBUF_WAVEGENB_Pos)
#define TCC_WAVEBUF_WAVEGENB_DSTOP  (TCC_WAVEBUF_WAVEGENB_DSTOP_Val << TCC_WAVEBUF_WAVEGENB_Pos)
#define TCC_WAVEBUF_RAMPB_Pos       4            /**< \brief (TCC_WAVEBUF) Ramp Mode Buffer */
#define TCC_WAVEBUF_RAMPB_Msk       (0x3ul << TCC_WAVEBUF_RAMPB_Pos)
#define TCC_WAVEBUF_RAMPB(value)    ((TCC_WAVEBUF_RAMPB_Msk & ((value) << TCC_WAVEBUF_RAMPB_Pos)))
#define   TCC_WAVEBUF_RAMPB_RAMP1_Val     0x0ul  /**< \brief (TCC_WAVEBUF) RAMP1 operation */
#define   TCC_WAVEBUF_RAMPB_RAMP2A_Val    0x1ul  /**< \brief (TCC_WAVEBUF) Alternative RAMP2 operation */
#define   TCC_WAVEBUF_RAMPB_RAMP2_Val     0x2ul  /**< \brief (TCC_WAVEBUF) RAMP2 operation */
#define   TCC_WAVEBUF_RAMPB_RAMP2C_Val    0x3ul  /**< \brief (TCC_WAVEBUF) Critical RAMP2 operation */
#define TCC_WAVEBUF_RAMPB_RAMP1     (TCC_WAVEBUF_RAMPB_RAMP1_Val   << TCC_WAVEBUF_RAMPB_Pos)
#define TCC_WAVEBUF_RAMPB_RAMP2A    (TCC_WAVEBUF_RAMPB_RAMP2A_Val  << TCC_WAVEBUF_RAMPB_Pos)
#define TCC_WAVEBUF_RAMPB_RAMP2     (TCC_WAVEBUF_RAMPB_RAMP2_Val   << TCC_WAVEBUF_RAMPB_Pos)
#define TCC_WAVEBUF_RAMPB_RAMP2C    (TCC_WAVEBUF_RAMPB_RAMP2C_Val  << TCC_WAVEBUF_RAMPB_Pos)
#define TCC_WAVEBUF_CIPERENB_Pos    7            /**< \brief (TCC_WAVEBUF) Circular Period Enable Buffer */
#define TCC_WAVEBUF_CIPERENB        (0x1ul << TCC_WAVEBUF_CIPERENB_Pos)
#define TCC_WAVEBUF_CICCENB0_Pos    8            /**< \brief (TCC_WAVEBUF) Circular Channel 0 Enable Buffer */
#define TCC_WAVEBUF_CICCENB0        (1 << TCC_WAVEBUF_CICCENB0_Pos)
#define TCC_WAVEBUF_CICCENB1_Pos    9            /**< \brief (TCC_WAVEBUF) Circular Channel 1 Enable Buffer */
#define TCC_WAVEBUF_CICCENB1        (1 << TCC_WAVEBUF_CICCENB1_Pos)
#define TCC_WAVEBUF_CICCENB2_Pos    10           /**< \brief (TCC_WAVEBUF) Circular Channel 2 Enable Buffer */
#define TCC_WAVEBUF_CICCENB2        (1 << TCC_WAVEBUF_CICCENB2_Pos)
#define TCC_WAVEBUF_CICCENB3_Pos    11           /**< \brief (TCC_WAVEBUF) Circular Channel 3 Enable Buffer */
#define TCC_WAVEBUF_CICCENB3        (1 << TCC_WAVEBUF_CICCENB3_Pos)
#define TCC_WAVEBUF_CICCENB_Pos     8            /**< \brief (TCC_WAVEBUF) Circular Channel x Enable Buffer */
#define TCC_WAVEBUF_CICCENB_Msk     (0xFul << TCC_WAVEBUF_CICCENB_Pos)
#define TCC_WAVEBUF_CICCENB(value)  ((TCC_WAVEBUF_CICCENB_Msk & ((value) << TCC_WAVEBUF_CICCENB_Pos)))
#define TCC_WAVEBUF_POLB0_Pos       16           /**< \brief (TCC_WAVEBUF) Channel 0 Polarity Buffer */
#define TCC_WAVEBUF_POLB0           (1 << TCC_WAVEBUF_POLB0_Pos)
#define TCC_WAVEBUF_POLB1_Pos       17           /**< \brief (TCC_WAVEBUF) Channel 1 Polarity Buffer */
#define TCC_WAVEBUF_POLB1           (1 << TCC_WAVEBUF_POLB1_Pos)
#define TCC_WAVEBUF_POLB2_Pos       18           /**< \brief (TCC_WAVEBUF) Channel 2 Polarity Buffer */
#define TCC_WAVEBUF_POLB2           (1 << TCC_WAVEBUF_POLB2_Pos)
#define TCC_WAVEBUF_POLB3_Pos       19           /**< \brief (TCC_WAVEBUF) Channel 3 Polarity Buffer */
#define TCC_WAVEBUF_POLB3           (1 << TCC_WAVEBUF_POLB3_Pos)
#define TCC_WAVEBUF_POLB_Pos        16           /**< \brief (TCC_WAVEBUF) Channel x Polarity Buffer */
#define TCC_WAVEBUF_POLB_Msk        (0xFul << TCC_WAVEBUF_POLB_Pos)
#define TCC_WAVEBUF_POLB(value)     ((TCC_WAVEBUF_POLB_Msk & ((value) << TCC_WAVEBUF_POLB_Pos)))
#define TCC_WAVEBUF_SWAPB0_Pos      24           /**< \brief (TCC_WAVEBUF) Swap DTI Output Pair 0 Buffer */
#define TCC_WAVEBUF_SWAPB0          (1 << TCC_WAVEBUF_SWAPB0_Pos)
#define TCC_WAVEBUF_SWAPB1_Pos      25           /**< \brief (TCC_WAVEBUF) Swap DTI Output Pair 1 Buffer */
#define TCC_WAVEBUF_SWAPB1          (1 << TCC_WAVEBUF_SWAPB1_Pos)
#define TCC_WAVEBUF_SWAPB2_Pos      26           /**< \brief (TCC_WAVEBUF) Swap DTI Output Pair 2 Buffer */
#define TCC_WAVEBUF_SWAPB2          (1 << TCC_WAVEBUF_SWAPB2_Pos)
#define TCC_WAVEBUF_SWAPB3_Pos      27           /**< \brief (TCC_WAVEBUF) Swap DTI Output Pair 3 Buffer */
#define TCC_WAVEBUF_SWAPB3          (1 << TCC_WAVEBUF_SWAPB3_Pos)
#define TCC_WAVEBUF_SWAPB_Pos       24           /**< \brief (TCC_WAVEBUF) Swap DTI Output Pair x Buffer */
#define TCC_WAVEBUF_SWAPB_Msk       (0xFul << TCC_WAVEBUF_SWAPB_Pos)
#define TCC_WAVEBUF_SWAPB(value)    ((TCC_WAVEBUF_SWAPB_Msk & ((value) << TCC_WAVEBUF_SWAPB_Pos)))
#define TCC_WAVEBUF_MASK            0x0F0F0FB7ul /**< \brief (TCC_WAVEBUF) MASK Register */

/* -------- TCC_PERBUF : (TCC Offset: 0x6C) (R/W 32) Period Buffer -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct { // DITH4 mode
        uint32_t DITHERBUF: 4;     /*!< bit:  0.. 3  Dithering Buffer Cycle Number      */
        uint32_t PERBUF: 20;       /*!< bit:  4..23  Period Buffer Value                */
        uint32_t : 8;              /*!< bit: 24..31  Reserved                           */
    } DITH4;                     /*!< Structure used for DITH4                        */
    struct { // DITH5 mode
        uint32_t DITHERBUF: 5;     /*!< bit:  0.. 4  Dithering Buffer Cycle Number      */
        uint32_t PERBUF: 19;       /*!< bit:  5..23  Period Buffer Value                */
        uint32_t : 8;              /*!< bit: 24..31  Reserved                           */
    } DITH5;                     /*!< Structure used for DITH5                        */
    struct { // DITH6 mode
        uint32_t DITHERBUF: 6;     /*!< bit:  0.. 5  Dithering Buffer Cycle Number      */
        uint32_t PERBUF: 18;       /*!< bit:  6..23  Period Buffer Value                */
        uint32_t : 8;              /*!< bit: 24..31  Reserved                           */
    } DITH6;                     /*!< Structure used for DITH6                        */
    struct {
        uint32_t PERBUF: 24;       /*!< bit:  0..23  Period Buffer Value                */
        uint32_t : 8;              /*!< bit: 24..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} TCC_PERBUF_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

